{"name":"formatter","qualifiedName":"analyzer/formatter","comment":"","variables":{},"functions":{"setters":{},"getters":{},"constructors":{},"operators":{},"methods":{}},"classes":{"class":[{"name":"CodeFormatter","qualifiedName":"analyzer/formatter.CodeFormatter","preview":"<p>Dart source code formatter.</p>"},{"name":"CodeKind","qualifiedName":"analyzer/formatter.CodeKind","preview":"<p>Specifies the kind of code snippet to format.</p>"},{"name":"FormattedSource","qualifiedName":"analyzer/formatter.FormattedSource","preview":"<p>Formatted source.</p>"},{"name":"FormatterOptions","qualifiedName":"analyzer/formatter.FormatterOptions","preview":"<p>Formatter options.</p>"}],"typedef":{},"error":[]},"packageName":"analyzer","packageIntro":"<p>This code is part of an experimental port of the Editor's analysis engine from\nJava to Dart. While we will continue to support the Java version of the analysis\nengine and the services built on it, we also intend to provide the same services\nto Dart-based applications. This is very early code and we expect it to change,\npossibly in significant ways. While we are eager to see other people make use\nof the analysis engine, we also want to be clear, in case you are interested in\ndoing so, that the current API's should in no way be considered to be stable.</p>\n<p>In particular, this code was automatically translated from the Java\nimplementation. The Java implementation that was translated is still under\ndevelopment and will continue to change over time. The translator that was used\nis still under development and the output produced by the translator will change\nover time. Therefore, the API presented by this code will change. In addition,\nany edits made to this code will be overwritten the next time we re-generate\nthis code.</p>\n<p>If you are interested in using this code, despite the disclaimer above,\nfantastic! Please let the editor team know so that we can get a sense of the\ninterest in it. Also, feel free to ask questions and make requests for\nadditional functionality.</p>"}